Дошкольное_учреждение83/src/Catalogs/НоменклатураДел/НоменклатураДел.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатураДел</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Индекс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияДела</name>
    <type>
      <types>EnumRef.КатегорииДел</types>
    </type>
  </attributes>
  <attributes>
    <name>НомераСтатей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтметкаЭПК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Раздел</name>
    <type>
      <types>CatalogRef.РазделыНоменклатурыДел</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокХранения</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Catalogs/РазделыНоменклатурыДел/РазделыНоменклатурыДел.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РазделыНоменклатурыДел</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Индекс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Catalogs/НоменклатураДел/Forms/ФормаВыбора/Module.bsl
&НаКлиенте
Перем ПерваяАктивизация;

//////////////////////////////////////////////////////////////////////////////// 
// ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

&НаКлиенте
Процедура ОбработкаОжидания()
	
	Если Элементы.Разделы.ТекущаяСтрока <> Неопределено Тогда 
		Список.Параметры.УстановитьЗначениеПараметра("Раздел", Элементы.Разделы.ТекущаяСтрока);
	КонецЕсли;	
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////// 
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
// 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТекущаяСтрока") И ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда 
		РазделПриОткрытии = Параметры.ТекущаяСтрока.Раздел;
		ПоказыватьДелаЗа = Параметры.ТекущаяСтрока.Год;
		Организация = Параметры.ТекущаяСтрока.Организация;
	Иначе	
		РазделПриОткрытии = Справочники.РазделыНоменклатурыДел.ПустаяСсылка();
		
		Если ЗначениеЗаполнено(Параметры.Год) Тогда 
			ПоказыватьДелаЗа = Параметры.Год;
		Иначе
			ПоказыватьДелаЗа = Год(ТекущаяДата());
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.Организация) Тогда 
			Организация = Параметры.Организация;
		Иначе
			Организация = РаботаСОрганизациями.ПолучитьОрганизациюПоУмолчанию();
		КонецЕсли;
	КонецЕсли;
	
	// год
	Список.Параметры.УстановитьЗначениеПараметра("Год", ПоказыватьДелаЗа);
	Разделы.Параметры.УстановитьЗначениеПараметра("Год", ПоказыватьДелаЗа);
	
	// организация
	Если ЗначениеЗаполнено(Организация) Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьОтборУСпискаНаРавенство(Список.Отбор,
			Новый ПолеКомпоновкиДанных("Организация"), 
			Организация);
			
		ОбщегоНазначенияКлиентСервер.УстановитьОтборУСпискаНаРавенство(Разделы.Отбор,
			Новый ПолеКомпоновкиДанных("Организация"), 
			Организация);	
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьОтборУСписка(Список.Отбор,
			Новый ПолеКомпоновкиДанных("Организация"));
			
		ОбщегоНазначенияКлиентСервер.УдалитьОтборУСписка(Разделы.Отбор,
			Новый ПолеКомпоновкиДанных("Организация"));	
	КонецЕсли;
	
	// раздел
	Элементы.Разделы.ТекущаяСтрока = РазделПриОткрытии;
	Список.Параметры.УстановитьЗначениеПараметра("Раздел", РазделПриОткрытии);
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////// 
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
// 

&НаКлиенте
Процедура ПоказыватьДелаЗаПриИзменении(Элемент)
	
	Список.Параметры.УстановитьЗначениеПараметра("Год", ПоказыватьДелаЗа);
	Разделы.Параметры.УстановитьЗначениеПараметра("Год", ПоказыватьДелаЗа);
	
КонецПроцедуры

&НаКлиенте
Процедура РазделыПриАктивизацииСтроки(Элемент)
	
	Если ПерваяАктивизация = Истина Или ПерваяАктивизация = Неопределено Тогда
		ПерваяАктивизация = Ложь;
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбработкаОжидания", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Организация) Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьОтборУСпискаНаРавенство(Список.Отбор,
			Новый ПолеКомпоновкиДанных("Организация"), 
			Организация);
			
		ОбщегоНазначенияКлиентСервер.УстановитьОтборУСпискаНаРавенство(Разделы.Отбор,
			Новый ПолеКомпоновкиДанных("Организация"), 
			Организация);	
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьОтборУСписка(Список.Отбор,
			Новый ПолеКомпоновкиДанных("Организация"));
			
		ОбщегоНазначенияКлиентСервер.УдалитьОтборУСписка(Разделы.Отбор,
			Новый ПолеКомпоновкиДанных("Организация"));	
	КонецЕсли;
	
КонецПроцедуры
